### Python
##### -Pandas (Panel Data - this is used for data trasnformation)
##### -NumPy (Numerical Python - this package is used for mathematical or numerical operations)
##### -Scikit Learn - This package is consist of all the Machine Learning techniques including algorithms,evalutaion metrices, preprocessing functions etc
##### -Matplotlib/Seaborn - These packages are used for data visualization

##### Anaconda - Data Science package- All the ML or DS packages are pre-installed


##### important prerequisties in python
##### -collections
##### -lambda and map function
##### -functions

In [1]:
#list
l1 = [1,2,3,4,5]

In [2]:
#list comprehension

l2 = [x for x in range(0,50,5)]

In [3]:
l2

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [4]:
l2[0] = 100

In [5]:
l2[1] = 100

In [6]:
l2

[100, 100, 10, 15, 20, 25, 30, 35, 40, 45]

### Features of List

#### 1.Hetrogenious
#### 2.Mutable
#### 3.Ordered
#### 4.Can have duplicates

In [7]:
#Set
s1 ={1,5,3,3,2,4}

In [8]:
len(s1)

5

In [9]:
s1.add(2)

In [10]:
s1

{1, 2, 3, 4, 5}

In [11]:
s1.add("hello")

In [12]:
s1

{1, 2, 3, 4, 5, 'hello'}

### Features of Set

#### 1.Hetrogenious
#### 2.Mutable
#### 3.not ordered
#### 4.Does not contain duplicates

In [13]:
#Tuple
t1 = (1,2,3,3,5.65,"hello")

In [14]:
t1

(1, 2, 3, 3, 5.65, 'hello')

In [15]:
t1[0] = 10

TypeError: 'tuple' object does not support item assignment

# ## Features of Tuple

#### 1.Hetrogenious
#### 2.Immutable
#### 3.ordered
#### 4.Can contain duplicates

In [16]:
#Dictionary
#Dictionary is a key value pair

d1 = {"name":"Christy",
     "nationality":"India",
     "age":27,
     "age":26}

In [17]:
d1

{'name': 'Christy', 'nationality': 'India', 'age': 26}

In [18]:
d1['age'] = 26

In [19]:
d1['name']

'Christy'

### Features of Dict

#### 1.Hetrogenious
#### 2.Mutable
#### 3.Indexed
#### 4.Can contain duplicates in values, not in keys

In [20]:
text = "christy"

In [21]:
text[0] = "A"  #string is immutable

TypeError: 'str' object does not support item assignment

### Pandas - Panel Data

#### To import any package use the keyword 
### import pacakge name as alias name

In [22]:
import pandas as pd #importing pacakge pandas as pd

In [23]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = '29d6b0232aab9576afa896ff5bab0b994760495a'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.0.1

FILE
    c:\users\christy\anaconda3\lib\site-packages\pandas\__init__.py

### Pandas datatypes
#### 1. Series - 1 Dimenesional Data
#### 2. DataFrame - 2 Dimensional Data
#### 3. Panel - 3 Dimesional Data

In [24]:
data = pd.read_csv(r"data/adult.csv")

In [25]:
data.head(10) #to get the first n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K
5,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K
6,29,?,227026,HS-grad,9,Never-married,?,Unmarried,Black,Male,0,0,40,United-States,<=50K
7,63,Self-emp-not-inc,104626,Prof-school,15,Married-civ-spouse,Prof-specialty,Husband,White,Male,3103,0,32,United-States,>50K
8,24,Private,369667,Some-college,10,Never-married,Other-service,Unmarried,White,Female,0,0,40,United-States,<=50K
9,55,Private,104996,7th-8th,4,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,10,United-States,<=50K

In [26]:
#basic functions in pandas

In [27]:
type(data) #to know the type of the object

pandas.core.frame.DataFrame

In [28]:
data.head(3) #to get the first n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K

In [29]:
data.tail(3) #to get the last n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [30]:
data.dtypes #to check the data types of each column

#dtypes,shape etc are not functions, they are the features of the dataframe.

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [31]:
data.shape

(48842, 15)

In [32]:
#to get the dimensions (rows,columns)

#to identify the dimensions of data
print("The dataframe has",data.shape[0],"observations(rows) and", data.shape[1],"features(columns)" )

The dataframe has 48842 observations(rows) and 15 features(columns)

In [33]:
data.describe() #Summary of numerical columns (int64,float64,uint8)

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [34]:
data.describe(include='O') #Summary of Object columns

,workclass,education,marital-status,occupation,relationship,race,gender,native-country,income
count,48842,48842,48842,48842,48842,48842,48842,48842,48842
unique,9,16,7,15,6,5,2,42,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,33906,15784,22379,6172,19716,41762,32650,43832,37155

In [35]:
#checking for the missing value information 
data.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [36]:
#displaying index  index is also a feature/property
data.index

RangeIndex(start=0, stop=48842, step=1)

In [37]:
#displaying columns it is a feature
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

### Creating a Series

In [38]:
s = pd.Series([1, 3, 5, 6, 8,9,10])

In [39]:
type(s)

pandas.core.series.Series

In [40]:
s.shape

(7,)

In [41]:
s.dtypes

dtype('int64')

In [42]:
s.head()

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [43]:
s.tail()

2     5
3     6
4     8
5     9
6    10
dtype: int64

In [44]:
s.describe()

count     7.000000
mean      6.000000
std       3.265986
min       1.000000
25%       4.000000
50%       6.000000
75%       8.500000
max      10.000000
dtype: float64

# Creating DataFrame

In [45]:
#1 Loading existing data
#2 create a DataFrame Programatically

df = pd.DataFrame([["A",20],["B",21],["C",22],["D",23],['E',24]],columns=['Name','Age'])

In [46]:
df

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    E   24

In [47]:
df.shape

(5, 2)

In [48]:
df.head()

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    E   24

In [49]:
df.tail()

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    E   24

In [50]:
df.dtypes

Name    object
Age      int64
dtype: object

In [51]:
df.describe()

             Age
count   5.000000
mean   22.000000
std     1.581139
min    20.000000
25%    21.000000
50%    22.000000
75%    23.000000
max    24.000000

In [52]:
gender = ['M','F','F','M','F']

In [53]:
df['Gender']  = gender

In [54]:
df

  Name  Age Gender
0    A   20      M
1    B   21      F
2    C   22      F
3    D   23      M
4    E   24      F

### Access Data from DataFrame

In [55]:
#to access a column

df['Name']

0    A
1    B
2    C
3    D
4    E
Name: Name, dtype: object

In [56]:
df[['Name','Age']]

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    E   24

In [57]:
#to acess row we need to specify the row index.
#loc means location -we are specifying the location by index.

df.loc[[0,1,2]]

  Name  Age Gender
0    A   20      M
1    B   21      F
2    C   22      F

In [58]:
df.index = df['Name']

In [59]:
df

     Name  Age Gender
Name
A       A   20      M
B       B   21      F
C       C   22      F
D       D   23      M
E       E   24      F

In [60]:
df.loc[['A','B','C']] #in loc function we are providing the actual index.

     Name  Age Gender
Name
A       A   20      M
B       B   21      F
C       C   22      F

In [61]:
#iloc function accept range index. ie (0,1,2,...)

df.iloc[range(0,df.shape[0])]

     Name  Age Gender
Name
A       A   20      M
B       B   21      F
C       C   22      F
D       D   23      M
E       E   24      F

In [62]:
#To access a cell using loc

df.loc['A','Age'] = 50

In [63]:
#To access a cell using iloc

df.iloc[0,1]

50

In [64]:
df

     Name  Age Gender
Name
A       A   50      M
B       B   21      F
C       C   22      F
D       D   23      M
E       E   24      F

In [65]:
#duplicate index
#1 Loading existing data
#2 create a DataFrame Programatically

df1 = pd.DataFrame([["A",20],["B",21],["C",22],["D",23],['A',24]],columns=['Name','Age'])

In [66]:
df1.index = df1['Name']

In [67]:
df1.loc['A']

     Name  Age
Name
A       A   20
A       A   24

### Delete rows and columns from DataFrame

In [68]:
#for deleting rows and columns we use function called 'drop'

#we have to specify the axis 
#Axis=0 for rows
#Axis=1 for columns

df = df.drop('A') #default value for axis is 0.

In [69]:
df

     Name  Age Gender
Name
B       B   21      F
C       C   22      F
D       D   23      M
E       E   24      F

In [70]:
df = df.drop('Gender',axis=1)

In [71]:
df

     Name  Age
Name
B       B   21
C       C   22
D       D   23
E       E   24

In [72]:
del df['Age'] #del command is an alternative to delete columns

In [73]:
df

     Name
Name
B       B
C       C
D       D
E       E

In [74]:
#mathematical functions/ statistical functions

In [75]:
data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [118]:
#to calculate the mean
avg = data["age"].mean()
type(avg)

float

In [81]:
#to calculate the median
median = data['age'].median()
type(median)

float

In [82]:
# to calculate the mode
modes = data['gender'].mode()
type(modes)

pandas.core.series.Series

In [120]:
modeseries = pd.Series([1,1,1,2,2,2,2])
modeseries.mode()

0    2
dtype: int64

In [88]:
#standard deviation
data['age'].std()

13.71050993444322

In [102]:
test_series = pd.Series([1,2,2,2,2,6,5,4,3,5,4,9,2,4,20,20,10,10])

In [119]:
test_series

0      1
1      2
2      2
3      2
4      2
5      6
6      5
7      4
8      3
9      5
10     4
11     9
12     2
13     4
14    20
15    20
16    10
17    10
dtype: int64

In [103]:
test_series.dtypes

dtype('int64')

In [104]:
test_series.shape

(18,)

In [105]:
test_series.sum()

111

In [107]:
cal_mean  = 111/18
cal_mean

6.166666666666667

In [108]:
test_series.mean()

6.166666666666667

In [126]:
#to calculate the median we are sorting the series
ts = test_series.sort_values()
ts= ts.reset_index(drop=True)
ts

0      1
1      2
2      2
3      2
4      2
5      2
6      3
7      4
8      4
9      4
10     5
11     5
12     6
13     9
14    10
15    10
16    20
17    20
dtype: int64

In [111]:
cal_median = (4+4)/2

In [109]:
## median of [1,2,3,4] = (2+3)/2 = 2.5
## median of [1,2,3,4,5] = 3

In [112]:
test_series.median()

4.0

In [113]:
calc_mode = 2

In [114]:
test_series.mode()

0    2
dtype: int64

In [115]:
data['gender'].mode()

0    Male
dtype: object

In [128]:

#with nan value  --   in calculation null values are omited
import numpy as np
test_series = pd.Series([1,2,2,2,2,6,5,4,3,5,4,9,2,4,20,20,10,10,np.nan])
test_series

0      1.0
1      2.0
2      2.0
3      2.0
4      2.0
5      6.0
6      5.0
7      4.0
8      3.0
9      5.0
10     4.0
11     9.0
12     2.0
13     4.0
14    20.0
15    20.0
16    10.0
17    10.0
18     NaN
dtype: float64

In [129]:
test_series.mean()

6.166666666666667